Config/Reports/СправкаРасчетРаспределениеКосвенныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СправкаРасчетРаспределениеКосвенныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбщихЗатратНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/InformationRegisters/МетодыРаспределенияКосвенныхЗатратОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МетодыРаспределенияКосвенныхЗатратОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВБазуОплатаТрудаКЭК212</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВБазуОплатаТрудаКЭК213</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВБазуОплатаТрудаКЭК214</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбщихЗатратНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбщихЗатратНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/InformationRegisters/РасчетБазыРаспределенияКЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасчетБазыРаспределенияКЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбщихЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбщихЗатратНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыОбщихЗатратНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбщихЗатратНаПроизводство</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщепроизводственныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщехозяйственныеЗатраты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/БазыРаспределенияКосвенныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БазыРаспределенияКосвенныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямыеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучноеРаспределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрируетсяВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Reports/СправкаРасчетРаспределениеКосвенныхЗатрат/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(ТабДокумент) Экспорт
	
	ЛокальныеПеременные = Новый Структура;
	ЛокальныеПеременные.Вставить("мВидОПЗ",Перечисления.ВидыОбщихЗатратНаПроизводство.ОбщепроизводственныеЗатраты);
	ЛокальныеПеременные.Вставить("мВидОХЗ",Перечисления.ВидыОбщихЗатратНаПроизводство.ОбщехозяйственныеЗатраты);

	ЛокальныеПеременные.Вставить("мБазаОплатаТруда",Перечисления.БазыРаспределенияКосвенныхЗатрат.ОплатаТруда);
	ЛокальныеПеременные.Вставить("мБазаМатериальныеЗатраты", Перечисления.БазыРаспределенияКосвенныхЗатрат.МатериальныеЗатраты);
	ЛокальныеПеременные.Вставить("мБазаПрямыеЗатраты", Перечисления.БазыРаспределенияКосвенныхЗатрат.ПрямыеЗатраты);
	ЛокальныеПеременные.Вставить("мБазаВыручка", Перечисления.БазыРаспределенияКосвенныхЗатрат.Выручка);

	Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.60")).ЭлементГруппа Тогда
		ЛокальныеПеременные.Вставить("мСчет10961", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.61"));
	Иначе
		ЛокальныеПеременные.Вставить("мСчет10961", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.60"));
	КонецЕсли;
	Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.70")).ЭлементГруппа Тогда
		ЛокальныеПеременные.Вставить("мСчет10971", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.71"));
	Иначе
		ЛокальныеПеременные.Вставить("мСчет10971", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.70"));
	КонецЕсли;
	Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.80")).ЭлементГруппа Тогда
		ЛокальныеПеременные.Вставить("мСчет10981", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.81"));
	Иначе
		ЛокальныеПеременные.Вставить("мСчет10981", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.80"));
	КонецЕсли;
	ЛокальныеПеременные.Вставить("мЕстьНаправлениеДеятельности", БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(
																 ?(ВидКЗ = ЛокальныеПеременные.мВидОПЗ,
																   ЛокальныеПеременные.мСчет10971, 
																   ЛокальныеПеременные.мСчет10981),
																  ПланыВидовХарактеристик.ВидыСубконто.НаправленияДеятельности));
	
	
	
	ТабДокумент.Очистить();
	БазаРаспределения = "";
	МассивНоменклатурныхГрупп = СписокНоменклатуры.ВыгрузитьЗначения();
	ДеревоЗапроса = ВыполнитьЗапрос(МассивНоменклатурныхГрупп, БазаРаспределения, ЛокальныеПеременные);
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок        = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
	ОбластьПодСтрока        = Макет.ПолучитьОбласть("ПодСтрока");
	ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
	ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
	ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
	ОбластьОтветственный    = Макет.ПолучитьОбласть("Ответственный");
	
	//СтруктураРеквизиты = "";
	//ПолучениеНСИ.ПолучитьРеквизитыПоСсылке(Учреждение, СтруктураРеквизиты, "НаименованиеПолное");
	//ОрганизацияНаименование = СтруктураРеквизиты.НаименованиеПолное;
	ОрганизацияНаименование = Организация.НаименованиеПолное;
	
	СтрокаОтбора = "ИФО - " + ?(ЗначениеЗаполнено(ИФО), ИФО, "<>, ");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		СтрокаОтбора = СтрокаОтбора + "Подразделение - " + ?(ЗначениеЗаполнено(Подразделение), Подразделение, "<>") + ", ";
	КонецЕсли;
	СтрокаОтбора = СтрокаОтбора + "КФО - " + КФО;
	Если ЛокальныеПеременные.мЕстьНаправлениеДеятельности Тогда
		СтрокаОтбора = СтрокаОтбора + ", Направление деятельности - " 
									+ ?(ЗначениеЗаполнено(НаправлениеДеятельности), НаправлениеДеятельности, "<>");
	КонецЕсли;	
	
	ТипЗатратШапки = "";
	Если ВидКЗ = ЛокальныеПеременные.мВидОПЗ ТОгда
		ТипЗатратШапки = "Общепроизводственные";
		ТипЗатрат      = "общепроизводственных";
	Иначе	
		ТипЗатратШапки = "Общехозяйственные";
		ТипЗатрат      = "общехозяйственных";
	КонецЕсли;	
	
	База = "Распределение пропорционально ";
	Если БазаРаспределения = ЛокальныеПеременные.мБазаМатериальныеЗатраты Тогда
		База      = База + "материальным затратам";
		ТекстБазы = "Материальные затраты";
	ИначеЕсли БазаРаспределения = ЛокальныеПеременные.мБазаПрямыеЗатраты Тогда
		База      = База + "прямым затратам";
		ТекстБазы = "Прямые затраты";
	ИначеЕсли БазаРаспределения = ЛокальныеПеременные.мБазаОплатаТруда Тогда
		База      = База + "затратам по оплате труда";
		ТекстБазы = "Оплата труда";
	ИначеЕсли БазаРаспределения = ЛокальныеПеременные.мБазаВыручка Тогда
		База      = База + "выручке от продаж";
		ТекстБазы = "Выручка";
	КонецЕсли;	
	
	Для каждого СтрокаПериод из ДеревоЗапроса.Строки Цикл
		Если ДеревоЗапроса.Строки.Индекс(СтрокаПериод) > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;	
		
		ОбластьЗаголовок.Параметры.ОрганизацияНаименование = ОрганизацияНаименование; 
		ОбластьЗаголовок.Параметры.Дата         = КонецМесяца(СтрокаПериод.Период); 
		ОбластьЗаголовок.Параметры.Период       = "" + ПредставлениеПериода(НачалоМесяца(СтрокаПериод.Период),
																			КонецМесяца(СтрокаПериод.Период), 
																			"ФП = Истина");
		ОбластьЗаголовок.Параметры.СтрокаОтбора = СтрокаОтбора;
		ОбластьЗаголовок.Параметры.ТипЗатрат    = ТипЗатрат;
		
		ОбластьШапка.Параметры.ТипЗатратШапка = ТипЗатратШапки;
		ОбластьШапка.Параметры.База           = База;
		ОбластьШапка.Параметры.ТекстБазы      = ТекстБазы;
		
		ТабДокумент.Вывести(ОбластьЗаголовок);
		ТабДокумент.Вывести(ОбластьШапка);
		
		КолСтрок = 0;
		Для каждого СтрокаСчет из СтрокаПериод.Строки Цикл
			Для каждого СтрокаКПС из СтрокаСчет.Строки Цикл
				Для каждого СтрокаКЭКЗатрат из СтрокаКПС.Строки Цикл
					Для каждого СтрокаВидЗатрат из СтрокаКЭКЗатрат.Строки Цикл
						ЦветФонаГруппировки = ?(КолСтрок % 2 = 0, Новый Цвет(255, 212, 196), Новый Цвет);
						
						ОбластьСтрока.Параметры.Заполнить(СтрокаВидЗатрат);
						ОбластьСтрока.Параметры.СчетКЗ = "" + СтрокаВидЗатрат.КПСКЗ + "." 
												+ БухгалтерскийУчетПовтИсп.ПолучитьПредставлениеСчета(СтрокаВидЗатрат.СчетКЗ,,КФО)
												+ "." + СтрокаВидЗатрат.КЭКЗатрат;
						ОбластьСтрока.Параметры.СуммаЗатрат = СтрокаВидЗатрат.Сумма;
						
						ТабДокумент.Вывести(ОбластьСтрока);
						ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 9).ЦветФона 
																										= ЦветФонаГруппировки;
						
						ВсегоСуммаБазы = СтрокаВидЗатрат.СуммаБазы;
						
						Для каждого СтрокаНоменклатурнаяГруппа из СтрокаВидЗатрат.Строки Цикл
							Для каждого СтрокаСчетПЗ из СтрокаНоменклатурнаяГруппа.Строки Цикл
								ОбластьПодСтрока.Параметры.Заполнить(СтрокаСчетПЗ);
								ОбластьПодСтрока.Параметры.СчетПЗ = "" + СтрокаСчетПЗ.КПСПЗ + "." 
												+ БухгалтерскийУчетПовтИсп.ПолучитьПредставлениеСчета(СтрокаСчетПЗ.СчетПЗ,,КФО)
												+ "." + СтрокаСчетПЗ.КЭКПЗ;
								ОбластьПодСтрока.Параметры.Коэффициент = ?(ВсегоСуммаБазы = 0, 0, СтрокаСчетПЗ.СуммаБазы 
																								  / ВсегоСуммаБазы);
								
								ТабДокумент.Вывести(ОбластьПодСтрока);
								ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 9).ЦветФона 
																										= ЦветФонаГруппировки;
							КонецЦикла;	
						КонецЦикла;	
						
						ОбластьИтого.Параметры.Заполнить(СтрокаВидЗатрат);
						ТабДокумент.Вывести(ОбластьИтого);
						ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, 2, ТабДокумент.ВысотаТаблицы, 9).ЦветФона 
																										= ЦветФонаГруппировки;
						КолСтрок = КолСтрок + 1;
					КонецЦикла;	
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	
		
		ОбластьВсего.Параметры.Заполнить(СтрокаПериод);
		ТабДокумент.Вывести(ОбластьВсего);
		ТабДокумент.Вывести(ОбластьОкончаниеТаблицы);
		ТабДокумент.Вывести(ОбластьОтветственный);
	КонецЦикла;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ВыполнитьЗапрос(МассивНоменклатурныхГрупп, БазаРаспределения, ЛокальныеПеременные)
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВидОбщихЗатратНаПроизводство КАК ВидОбщихЗатрат,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.БазаРаспределения
	               |ИЗ
	               |	РегистрСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.СрезПоследних(
	               |			&ДатаЗапроса,
	               |			Организация = &Организация
	               |				И ВидОбщихЗатратНаПроизводство = &ВидКЗ) КАК МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних";
				   
	Запрос = Новый Запрос(ТекстЗапроса);			   
	Запрос.УстановитьПараметр("ДатаЗапроса", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидКЗ", ВидКЗ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БазаРаспределения = Выборка.БазаРаспределения;
	КонецЕсли;	
	
	ОтборПоНоменклатурнымГруппам = "";
	Если МассивНоменклатурныхГрупп.Количество() > 0 Тогда
		ОтборПоНоменклатурнымГруппам = "
										|И Субконто1 В ИЕРАРХИИ (&МассивНоменклатуры)";
	КонецЕсли;	
	
	ОтборПоНаправлениюДеятельности = "";
	ОтборПоНаправлениюДеятельностиДляРС = "";
	Если ЛокальныеПеременные.мЕстьНаправлениеДеятельности Тогда
		ОтборПоНаправлениюДеятельности = "
										|И Субконто2 = &НаправлениеДеятельности";
		ОтборПоНаправлениюДеятельностиДляРС = " И РасчетБазыРаспределенияКЗ.НаправлениеДеятельности = &НаправлениеДеятельности";
	КонецЕсли;	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЖурналПроводокЕПСБУОбороты.Период КАК Период,
	               |	ЖурналПроводокЕПСБУОбороты.Счет КАК СчетКЗ,
	               |	ЖурналПроводокЕПСБУОбороты.КПС КАК КПСКЗ,
	               |	ЖурналПроводокЕПСБУОбороты.КЭК КАК КЭКЗатрат,
	               |	ЖурналПроводокЕПСБУОбороты.Субконто1 КАК ВидЗатрат,
	               |	ЖурналПроводокЕПСБУОбороты.КЭККор КАК КЭКПЗ,
	               |	ЖурналПроводокЕПСБУОбороты.КорСубконто1 КАК НоменклатурнаяГруппа,
	               |	ЖурналПроводокЕПСБУОбороты.КорСчет КАК СчетПЗ,
	               |	ЖурналПроводокЕПСБУОбороты.КПСКор КАК КПСПЗ,
	               |	СУММА(ЖурналПроводокЕПСБУОбороты.СуммаОборотКт) КАК Сумма,
	               |	СУММА(РасчетБазыРаспределенияКЗ.Сумма) КАК СуммаБазы
	               |ИЗ
	               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	               |			&ДатаНачала,
	               |			&ДатаКонца,
	               |			&Периодичность,
	               |			Счет = &Счет109КЗ,
	               |			,
	               |			Организация = &Организация
	               |				И (ИФО = &ИФО  или &ИФО = Значение(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка))
	               |				И (Подразделение = &Подразделение  или &Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка))
	               |				И КФО = &КФО" + ОтборПоНаправлениюДеятельности + ОтборПоНоменклатурнымГруппам + ",
	               |			КорСчет = &Счет10961,
	               |			) КАК ЖурналПроводокЕПСБУОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетБазыРаспределенияКЗ КАК РасчетБазыРаспределенияКЗ
	               |		ПО ЖурналПроводокЕПСБУОбороты.Период = РасчетБазыРаспределенияКЗ.ПериодРасчета
	               |			И ЖурналПроводокЕПСБУОбороты.КорСубконто1 = РасчетБазыРаспределенияКЗ.НоменклатурнаяГруппа
	               |ГДЕ
	               |	РасчетБазыРаспределенияКЗ.ПериодРасчета МЕЖДУ &ДатаНачала И &ДатаКонца
	               |	И РасчетБазыРаспределенияКЗ.Организация = &Организация
	               |	И (РасчетБазыРаспределенияКЗ.ИФО = &ИФО или &ИФО = Значение(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка))
	               |	И (РасчетБазыРаспределенияКЗ.Подразделение = &Подразделение или &Подразделение = Значение(Справочник.Подразделения.ПустаяСсылка))
	               |	И РасчетБазыРаспределенияКЗ.КФО = &КФО
	               |	И РасчетБазыРаспределенияКЗ.ВидОбщихЗатрат = &ВидОбщихЗатрат
	               |    " + ОтборПоНаправлениюДеятельностиДляРС + "
	               |СГРУППИРОВАТЬ ПО
	               |	ЖурналПроводокЕПСБУОбороты.Счет,
	               |	ЖурналПроводокЕПСБУОбороты.КорСчет,
	               |	ЖурналПроводокЕПСБУОбороты.КПС,
	               |	ЖурналПроводокЕПСБУОбороты.КЭККор,
	               |	ЖурналПроводокЕПСБУОбороты.КорСубконто1,
	               |	ЖурналПроводокЕПСБУОбороты.КПСКор,
	               |	ЖурналПроводокЕПСБУОбороты.Период,
	               |	ЖурналПроводокЕПСБУОбороты.КЭК,
	               |	ЖурналПроводокЕПСБУОбороты.Субконто1
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период,
	               |	СчетКЗ,
	               |	КПСКЗ,
	               |	КЭКЗатрат,
	               |	ВидЗатрат,
	               |	НоменклатурнаяГруппа,
	               |	СчетПЗ,
	               |	КЭКПЗ,
	               |	КПСПЗ
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	СУММА(СуммаБазы)
	               |ПО
	               |	Период,
	               |	СчетКЗ,
	               |	КПСКЗ,
	               |	КЭКЗатрат,
	               |	ВидЗатрат,
	               |	НоменклатурнаяГруппа";

	Если УчетПроизводства.РассчитыватьСебестоимостьВКонцеГода(Организация, КонецПериода) Тогда
		Периодичность = "Год";
		НачалоПериода = НачалоГода(НачалоПериода);
	Иначе
		Периодичность = "Месяц";
		НачалоПериода = НачалоМесяца(НачалоПериода);
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Периодичность",                  Периодичность);
                        
	Запрос = Новый Запрос(ТекстЗапроса);			   
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИФО", ИФО);
	Запрос.УстановитьПараметр("КФО", КФО);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Счет10961", ЛокальныеПеременные.мСчет10961);
	Запрос.УстановитьПараметр("Счет109КЗ", ?(ВидКЗ = ЛокальныеПеременные.мВидОПЗ, 
											 ЛокальныеПеременные.мСчет10971, 
											 ЛокальныеПеременные.мСчет10981));
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатурныхГрупп);
	Запрос.УстановитьПараметр("ВидОбщихЗатрат", ВидКЗ);
	Если ЛокальныеПеременные.мЕстьНаправлениеДеятельности ТОгда
		Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	КонецЕсли;	
	
	ДеревоЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ДеревоЗапроса;
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НеПроверятьНаправлениеДеятельности = Ложь;
	Если ВидКЗ = Перечисления.ВидыОбщихЗатратНаПроизводство.ОбщепроизводственныеЗатраты Тогда
		Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.70")).ЭлементГруппа Тогда
			ПроверяемыйСчет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.71");
		Иначе
			ПроверяемыйСчет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.70");
		КонецЕсли;
		
		НеПроверятьНаправлениеДеятельности = НЕ БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(ПроверяемыйСчет,
																			ПланыВидовХарактеристик.ВидыСубконто.НаправленияДеятельности);
	ИначеЕсли ВидКЗ = Перечисления.ВидыОбщихЗатратНаПроизводство.ОбщехозяйственныеЗатраты Тогда
		Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.80")).ЭлементГруппа Тогда
			ПроверяемыйСчет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.81");
		Иначе
			ПроверяемыйСчет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.80");
		КонецЕсли;
		НеПроверятьНаправлениеДеятельности = НЕ БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(ПроверяемыйСчет,
																			ПланыВидовХарактеристик.ВидыСубконто.НаправленияДеятельности);
	КонецЕсли;
	Если НеПроверятьНаправлениеДеятельности Тогда
		ТекРеквизит = ПроверяемыеРеквизиты.Найти("НаправлениеДеятельности");
		Если ТекРеквизит<>Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ТекРеквизит);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
